9/data/attachments/da70b65144b23ab9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_279e6791-85e5-4108-8058-c7e6e5086953</nif:username>
            <nif:friendToBeAdded>Richard_despite_Actions_42505_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>